---
title: AreaBasedLoadType
classe: Autodesk.Revit.DB.Electrical.AreaBasedLoadType
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# AreaBasedLoadType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double ApparentPowerDensity { get; set; }` | `areaBasedLoadType.ApparentPowerDensity` | Double |
| `ElementId LoadClassification { get; set; }` | `areaBasedLoadType.LoadClassification` | ElementId |
| `Double LoadDensity { get; set; }` | `areaBasedLoadType.LoadDensity` | Double |
| `Double PowerFactor { get; set; }` | `areaBasedLoadType.PowerFactor` | Double |
| `PowerFactorStateType PowerFactorState { get; set; }` | `areaBasedLoadType.PowerFactorState` | PowerFactorStateType |
| `AreaBasedLoadType Create(Document, String)` | `AreaBasedLoadType.Create(document, name)` | AreaBasedLoadType |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```